Repository: megavegas/multi-database-manager
Catalog: languages/multi-db-manager-*.po
Languages: fa_ir

source: Multi-Database Manager
fa_ir: مدیریت چند دیتابیس

source: Settings
fa_ir: تنظیمات

source: Save
fa_ir: ذخیره

source: Cancel
fa_ir: انصراف

source: Delete
fa_ir: حذف

source: Edit
fa_ir: ویرایش

source: Update
fa_ir: بروزرسانی

source: Active
fa_ir: فعال

source: Inactive
fa_ir: غیرفعال

source: Yes
fa_ir: بله

source: No
fa_ir: خیر

source: Multi Database
fa_ir: چند دیتابیس

source: Dashboard
fa_ir: داشبورد

source: Database Settings
fa_ir: تنظیمات دیتابیس

source: Migration Tools
fa_ir: ابزار انتقال

source: WooCommerce Settings
fa_ir: تنظیمات ووکامرس

source: Total Databases
fa_ir: کل دیتابیس‌ها

source: Active Databases
fa_ir: دیتابیس فعال

source: Total Posts
fa_ir: کل پست‌ها

source: Total Size
fa_ir: حجم کل

source: Active Databases Overview
fa_ir: دیتابیس‌های فعال

source: No active database found. Add a new database to get started.
fa_ir: هیچ دیتابیس فعالی وجود ندارد. برای شروع یک دیتابیس جدید اضافه کنید.

source: Add Database
fa_ir: افزودن دیتابیس

source: Name
fa_ir: نام

source: Database
fa_ir: دیتابیس

source: Post Types
fa_ir: پست تایپ‌ها

source: Size
fa_ir: حجم

source: Status
fa_ir: وضعیت

source: Actions
fa_ir: عملیات

source: None
fa_ir: ندارد

source: Refresh
fa_ir: به‌روزرسانی

source: WooCommerce Statistics
fa_ir: آمار ووکامرس

source: Products
fa_ir: محصولات

source: Orders
fa_ir: سفارشات

source: Customers
fa_ir: مشتریان

source: Coupons
fa_ir: کوپن‌ها

source: WooCommerce has not been separated yet.
fa_ir: ووکامرس هنوز جداسازی نشده است.

source: Separate WooCommerce
fa_ir: جداسازی ووکامرس

source: Latest Events
fa_ir: آخرین رویدادها

source: No events logged yet
fa_ir: رویدادی ثبت نشده است

source: Quick Actions
fa_ir: عملیات سریع

source: Add New Database
fa_ir: افزودن دیتابیس جدید

source: Migrate Data
fa_ir: انتقال داده‌ها

source: Refresh All
fa_ir: به‌روزرسانی همه

source: Edit Database
fa_ir: ویرایش دیتابیس

source: Identifier Name
fa_ir: نام شناسایی

source: Unique name to identify the database (only lowercase letters, numbers and dashes)
fa_ir: نام یکتا برای شناسایی دیتابیس (فقط حروف انگلیسی کوچک، اعداد و خط تیره)

source: Connection Information
fa_ir: اطلاعات اتصال

source: Host
fa_ir: میزبان

source: Port
fa_ir: پورت

source: Database Name
fa_ir: نام دیتابیس

source: Username
fa_ir: نام کاربری

source: Password
fa_ir: رمز عبور

source: To change password, enter new password. Otherwise leave empty.
fa_ir: برای تغییر رمز، رمز جدید را وارد کنید. در غیر این صورت خالی بگذارید.

source: Charset
fa_ir: مجموعه کاراکتر

source: Collation
fa_ir: تطبیق

source: Select Post Types
fa_ir: انتخاب پست تایپ‌ها

source: Post types to be stored in this database
fa_ir: پست تایپ‌هایی که در این دیتابیس ذخیره شوند

source: Enable this database
fa_ir: فعال سازی این دیتابیس

source: If disabled, this database will not be used
fa_ir: اگر فعال نباشد، از این دیتابیس استفاده نخواهد شد

source: Test Connection
fa_ir: تست اتصال

source: Testing connection...
fa_ir: در حال تست اتصال...

source: Connection successful
fa_ir: اتصال با موفقیت برقرار شد

source: Connection failed: %s
fa_ir: اتصال ناموفق: %s

source: Settings saved successfully
fa_ir: تنظیمات با موفقیت ذخیره شد

source: Error saving settings
fa_ir: خطا در ذخیره تنظیمات

source: Settings deleted
fa_ir: تنظیمات حذف شد

source: Error deleting settings
fa_ir: خطا در حذف تنظیمات

source: Database activated
fa_ir: دیتابیس فعال شد

source: Database deactivated
fa_ir: دیتابیس غیرفعال شد

source: Existing Databases
fa_ir: دیتابیس‌های موجود

source: No database configured. Add your first database using the form on the left.
fa_ir: هیچ دیتابیسی تعریف نشده است. از فرم سمت چپ اولین دیتابیس را اضافه کنید.

source: Activate
fa_ir: فعال کردن

source: Deactivate
fa_ir: غیرفعال کردن

source: Are you sure you want to delete this database?
fa_ir: آیا از حذف این دیتابیس اطمینان دارید؟

source: Data Migration
fa_ir: انتقال داده‌ها

source: No active database available for migration. Please add a database first.
fa_ir: هیچ دیتابیس فعالی برای انتقال وجود ندارد. ابتدا یک دیتابیس اضافه کنید.

source: Select Post Type
fa_ir: انتخاب پست تایپ

source: -- Select --
fa_ir: -- انتخاب کنید --

source: Target Database
fa_ir: دیتابیس مقصد

source: Migration Settings
fa_ir: تنظیمات انتقال

source: Backup before migration
fa_ir: پشتیبان‌گیری قبل از انتقال

source: Recommended to always keep enabled
fa_ir: توصیه می‌شود همیشه فعال باشد

source: Dry Run (Test Mode)
fa_ir: حالت تست (Dry Run)

source: Simulation only, no actual migration
fa_ir: فقط شبیه‌سازی، بدون انتقال واقعی

source: Delete from source database
fa_ir: حذف از دیتابیس مبدا

source: Warning: Data will be deleted from the original database
fa_ir: هشدار: داده‌ها از دیتابیس اصلی حذف می‌شوند

source: Estimate Time & Size
fa_ir: تخمین زمان و حجم

source: Start Migration
fa_ir: شروع انتقال

source: Migration Progress
fa_ir: پیشرفت انتقال

source: Migrating...
fa_ir: در حال انتقال...

source: Completed
fa_ir: انجام شده

source: Total
fa_ir: کل

source: Remaining
fa_ir: باقیمانده

source: Migration successful
fa_ir: انتقال با موفقیت انجام شد

source: Migration failed
fa_ir: خطا در انتقال

source: New Migration
fa_ir: انتقال جدید

source: Backup Files
fa_ir: فایل‌های پشتیبان

source: No backup files available
fa_ir: هیچ فایل پشتیبانی موجود نیست

source: Download
fa_ir: دانلود

source: Migration Guide
fa_ir: راهنمای انتقال

source: Migration Steps:
fa_ir: مراحل انتقال:

source: Select the desired post type
fa_ir: پست تایپ مورد نظر را انتخاب کنید

source: Specify the target database
fa_ir: دیتابیس مقصد را مشخص کنید

source: Keep backup option enabled
fa_ir: گزینه پشتیبان‌گیری را فعال نگه دارید

source: First test with 'Dry Run'
fa_ir: ابتدا با 'حالت تست' بررسی کنید

source: Finally start the actual migration
fa_ir: در نهایت انتقال واقعی را شروع کنید

source: Important Notes:
fa_ir: نکات مهم:

source: Always take a complete backup before migration
fa_ir: قبل از انتقال حتماً از سایت backup کامل بگیرید

source: Migration may take time depending on data size
fa_ir: انتقال بسته به حجم ممکن است زمان‌بر باشد

source: Do not close the page during migration
fa_ir: در حین انتقال صفحه را نبندید

source: Only enable 'Delete from source' after verification
fa_ir: گزینه 'حذف از مبدا' را فقط بعد از اطمینان فعال کنید

source: Are you sure you want to start the migration?
fa_ir: آیا از انتقال داده‌ها اطمینان دارید؟

source: WooCommerce Separation
fa_ir: جداسازی ووکامرس

source: Move all products, orders and WooCommerce data to a separate database
fa_ir: تمام محصولات، سفارشات و داده‌های ووکامرس را به یک دیتابیس مجزا منتقل کنید

source: Separated
fa_ir: جداسازی شده

source: Not Separated
fa_ir: جداسازی نشده

source: WooCommerce is not active!
fa_ir: ووکامرس فعال نیست!

source: Automatic Separation
fa_ir: جداسازی خودکار

source: This feature will automatically:
fa_ir: این ویژگی به صورت خودکار:

source: Create a new database for WooCommerce
fa_ir: یک دیتابیس جدید برای ووکامرس ایجاد می‌کند

source: Copy all WooCommerce tables
fa_ir: تمام جداول ووکامرس را کپی می‌کند

source: Configure WooCommerce post types
fa_ir: پست تایپ‌های ووکامرس را تنظیم می‌کند

source: Prepare for data migration
fa_ir: آماده برای انتقال داده‌ها می‌شود

source: New Database Information:
fa_ir: اطلاعات دیتابیس جدید:

source: Name of new database to be created
fa_ir: نام دیتابیس جدید که ایجاد خواهد شد

source: Auto-Separate WooCommerce
fa_ir: جداسازی خودکار ووکامرس

source: Size & Time Estimate
fa_ir: تخمین حجم و زمان

source: Number of Tables
fa_ir: تعداد جداول

source: WooCommerce Tables:
fa_ir: جداول ووکامرس:

source: Table
fa_ir: جدول

source: Records
fa_ir: رکورد

source: Estimated time: 5-15 minutes depending on data volume
fa_ir: زمان تقریبی: 5-15 دقیقه بسته به حجم داده‌ها

source: WooCommerce Post Types
fa_ir: پست تایپ‌های ووکامرس

source: Statistics
fa_ir: آمار

source: Health Status
fa_ir: وضعیت سلامت

source: Overall Status:
fa_ir: وضعیت کلی:

source: Healthy
fa_ir: سالم

source: Warning
fa_ir: هشدار

source: Error
fa_ir: خطا

source: Missing Tables:
fa_ir: جداول ناقص:

source: Warnings:
fa_ir: هشدارها:

source: Everything looks great!
fa_ir: همه چیز عالی است!

source: Database Information
fa_ir: اطلاعات دیتابیس

source: Edit Settings
fa_ir: ویرایش تنظیمات

source: Operations
fa_ir: عملیات

source: Migrate WooCommerce Data
fa_ir: انتقال داده‌های ووکامرس

source: Update Statistics
fa_ir: به‌روزرسانی آمار

source: Test Functionality
fa_ir: تست عملکرد

source: Field %s is required
fa_ir: فیلد %s الزامی است

source: Invalid host address
fa_ir: آدرس host نامعتبر است

source: Invalid port number
fa_ir: شماره پورت نامعتبر است

source: Database config not found
fa_ir: تنظیمات دیتابیس یافت نشد

source: Connection failed to target database
fa_ir: اتصال به دیتابیس هدف ناموفق

source: Table not found in source database
fa_ir: جدول در دیتابیس مبدا یافت نشد

source: Error creating table
fa_ir: خطا در ایجاد جدول

source: Backup file not found
fa_ir: فایل پشتیبان یافت نشد

source: Error reading backup file
fa_ir: خطا در خواندن فایل پشتیبان

source: Unauthorized access
fa_ir: دسترسی غیرمجاز

source: Error communicating with server
fa_ir: خطا در برقراری ارتباط با سرور

source: Identifier name can only contain lowercase letters, numbers, dashes and underscores
fa_ir: نام شناسایی فقط می‌تواند شامل حروف انگلیسی کوچک، اعداد، خط تیره و زیرخط باشد

source: Please fill all required fields
fa_ir: لطفاً تمام فیلدهای الزامی را پر کنید

source: Are you sure? This operation may take several minutes.
fa_ir: آیا مطمئن هستید؟ این عملیات ممکن است چند دقیقه طول بکشد.

source: WooCommerce separation completed successfully! You can now go to the migration section.
fa_ir: جداسازی ووکامرس با موفقیت انجام شد! اکنون می‌توانید به قسمت انتقال داده‌ها بروید.

source: Copied!
fa_ir: کپی شد!

source: Success
fa_ir: موفق

source: Failed
fa_ir: ناموفق

source: Processing...
fa_ir: در حال پردازش...

source: Loading...
fa_ir: در حال بارگذاری...

source: Please wait...
fa_ir: لطفاً صبر کنید...
